+TITLE: Configuración Emacs
#+author: Álvaro González (@alvarogonzalez)
#+OPTIONS: toc:2 h:4 author:t


#+latex: \newpage
#+html: <div style="margin:auto; text-align:center; font-size:1.5em">
#+latex: \begin{center}
La última versión de esta configuración puede encontrarse en [[https://github.com/alvarogonzalezsotillo/.emacs.d][https://github.com/alvarogonzalezsotillo/.emacs.d]].
#+latex: \end{center}
#+html: </div>



** =vertico=


#+begin_src emacs-lisp

(use-package marginalia
  :ensure t
  :defer 1
  :custom
  (marginalia-max-relative-age 0)
  (marginalia-align 'right)
  :init
  (marginalia-mode))


(use-package all-the-icons-completion
  :ensure t
  :defer 1
  :after (marginalia all-the-icons)
  :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
  :init
  (all-the-icons-completion-mode))

(use-package vertico
  :ensure t
  :defer 1
  :custom
  (vertico-count 13)                    ; Number of candidates to display
  (vertico-resize nil)
  (vertico-cycle nil) ; Go from last to first candidate and first to last (cycle)?

  :config
  (vertico-mode))

(use-package vertico-mouse
  :ensure nil
  :config
  (vertico-mouse-mode 1)
  )

(use-package vertico-posframe
  :after vertico
  :ensure t
  :defer 1
  :config
  (setq vertico-posframe-border-width 6)

  ;;(setq vertico-posframe-poshandler #'ags/posframe-poshandler-right-verticaly-centered)
  (setq vertico-posframe-poshandler #'posframe-poshandler-frame-bottom-center)
  
  (when (posframe-workable-p)
    (vertico-posframe-mode 1)))


(use-package orderless
  :ensure t
  :defer 1
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))


(use-package consult
  :after projectile
  :ensure t
  :defer 1
  :bind
  (("<f6>"  . consult-buffer)
   ("C-x r b" . consult-bookmark)
   ("M-y" . consult-yank-pop)
   ("M-g g" . consult-goto-line)
   ("C-f" . consult-line)
   ("C-S-f" . consult-line-multi)
   ("M-<f7>" . consult-imenu )
   )

  :config
  ;;(define-key minibuffer-mode-map (kbd "S-<f6>") 'previous-line-or-history-element)
  ;;(define-key minibuffer-mode-map (kbd "<f6>") 'next-line-or-history-element)
  (define-key projectile-command-map (kbd "s g") 'consult-git-grep)
  )

(use-package consult-projectile
  :ensure t
  :defer 1
  :after projectile

  :bind
  (("C-<f6>"  . consult-projectile-switch-to-buffer) )

  :config
  (setq consult-projectile-use-projectile-switch-project t)
  (setq xref-show-xrefs-function #'consult-xref)
  (setq xref-show-definitions-function #'consult-xref)
  (setq consult-narrow-key "<")
  (setq consult-widen-key ">")
  (define-key projectile-command-map (kbd "f") #'consult-projectile-find-file)
  ;;(define-key projectile-command-map (kbd "p") #'consult-projectile-switch-project) ;; MIENTRAS SE QUEDE ENGANCHADO CON TRAMP
  (define-key projectile-command-map (kbd "p") #'projectile-switch-project) ;; MIENTRAS SE QUEDE ENGANCHADO CON TRAMP
  (define-key projectile-command-map (kbd "s s") #'consult-ripgrep)
  )


(use-package embark
  :ensure t

  :bind
  (("C-ñ" . embark-act)         ;; pick some comfortable binding
   ("C--" . embark-dwim)        ;; good alternative: M-.
   ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

  :init

  ;; Optionally replace the key help with a completing-read interface
  ;; (setq prefix-help-command #'embark-prefix-help-command)

  ;; Show the Embark target at point via Eldoc. You may adjust the
  ;; Eldoc strategy, if you want to see the documentation from
  ;; multiple providers. Beware that using this can be a little
  ;; jarring since the message shown in the minibuffer can be more
  ;; than one line, causing the modeline to move up and down:

  ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

  :config

  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

;; Consult users will also want the embark-consult package.
(use-package embark-consult
  :ensure t ; only need to install it, embark loads it after consult if found
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))

#+end_src

#+RESULTS:
| embark-consult--upgrade-markers | consult-preview-at-point-mode |


** =
#+begin_src emacs-lisp
(use-package outline-indent
  :ensure t
  :defer 1
  :custom
  (outline-indent-ellipsis " ▼ "))
#+end_src 

#+RESULTS:
: [nil 0 1 0 nil require (outline-indent nil t) idle 0 nil]

** =sideline=

#+begin_src emacs-lisp

(use-package sideline-flycheck
  :defer 1
  :ensure t
  :hook (flycheck-mode . sideline-flycheck-setup))

(use-package sideline-blame
  :defer 1
  :ensure t )

(use-package sideline
  :defer 1
  :ensure t
  :init

  :hook (flycheck-mode . sideline-mode)

  :config
  
  (setq sideline-backends-right '((sideline-flycheck . up)))



  (setq sideline-backends-skip-current-line t  ; don't display on current line
        sideline-order-left 'down              ; or 'up
        sideline-order-right 'up               ; or 'down
        sideline-format-left "%s   "           ; format for left aligment
        sideline-format-right "   %s"          ; format for right aligment
        sideline-priority 100                  ; overlays' priority
        sideline-display-backend-name nil))      ; display the backend name
#+end_src

#+RESULTS:
| sideline-mode | sideline-flycheck-setup | rustic-flycheck-setup | flycheck-mode-set-explicitly |


** /wrap/ adaptativo

#+begin_src emacs-lisp
(use-package adaptive-wrap
  :ensure t
  :defer 1
  )
#+end_src

#+RESULTS:
: [nil 0 1 0 nil require (adaptive-wrap nil t) idle 0 nil]

** Código fuente

#+begin_src emacs-lisp
(defun ags/bonito-para-codigo()
  (interactive)
  (blamer-mode -1)
  (toggle-truncate-lines 1)
  ;;(indent-guide-mode 1)
  (toggle-word-wrap 1)
  (if (>= emacs-major-version 26)
      (display-line-numbers-mode 1))
  (auto-highlight-symbol-mode 1)
  (electric-pair-local-mode 1)
  (indent-bars-mode 1)
  (origami-mode 1))

  (add-hook 'prog-mode-hook 'ags/bonito-para-codigo)
#+end_src

#+RESULTS:
| yas-minor-mode | ags/bonito-para-codigo | ags/company-backends-prog-mode-function |

* Zona de pruebas


#+begin_src emacs-lisp
(use-package ellama
  :defer 1
  :ensure t
  :config
  ;;fx-3EyjaAPRl4pK3cgyIDptG3OyoxSWPInCMh8dv4SN4Utws3h9
  )


#+end_src

#+RESULTS:
: [nil 0 1 0 nil require (ellama nil t) idle 0 nil]


#+begin_src lisp
(use-package selection-highlight-mode
  :straight (selection-highlight-mode :type git
                                      :host github
                                      :repo "balloneij/selection-highlight-mode")
  :config (selection-highlight-mode))
#+end_src



#+begin_src emacs-lisp

(use-package impatient-mode
  :defer 1
  :ensure t
  :config 

  (defun ags/org-buffer-to-html-string (buffer)
    "Convierte el contenido del buffer Org actual a una cadena HTML."
    (require 'ox-html) ;; Asegúrate de que el paquete ox-html esté cargado

    ;; Configura las opciones de exportación según tus preferencias
    (with-current-buffer buffer
      (princ (org-export-string-as (buffer-string) 're-reveal t))
      (princ "hola")))
    


  (add-to-list 'imp-default-user-filters '(org-mode . ags/org-buffer-to-html-string))
  
  )
#+end_src

